In [1]:
%load_ext sql

In [2]:
# nhac lai ...
print('My name is Tien Dung. I am 58 years old')

My name is Tien Dung. I am 58 years old

In [3]:
name = 'Lan Huong'
age = 17
message = 'My name is {p_name}. I am {p_age} years old'.format(p_name=name, p_age=age)
print(message)

My name is Lan Huong. I am 17 years old

In [4]:
# chuan bi thong tin ket noi
server ='phpmyadmin.laptrinhphp.net'
db = 'gd_salesdb'
username = 'hv'
pwd = '123456'

In [5]:
# ket noi
connection_string = "mysql+pymysql://{user}:{password}@{host}/{database}?charset=UTF8". \
    format(user=username, password=pwd, host=server, database=db)
%sql $connection_string

In [10]:
%sql select * from orders order by orderdate desc limit 10

 * mysql+pymysql://hv:***@phpmyadmin.laptrinhphp.net/gd_salesdb?charset=UTF8
10 rows affected.

[(827, datetime.datetime(2014, 5, 6, 0, 0), '543204', 73, Decimal('244.30')),
 (830, datetime.datetime(2014, 5, 6, 0, 0), '543207', 65, Decimal('1374.60')),
 (828, datetime.datetime(2014, 5, 6, 0, 0), '543205', 68, Decimal('586.00')),
 (829, datetime.datetime(2014, 5, 6, 0, 0), '543206', 9, Decimal('1057.00')),
 (826, datetime.datetime(2014, 5, 5, 0, 0), '543203', 58, Decimal('300.00')),
 (825, datetime.datetime(2014, 5, 5, 0, 0), '543202', 20, Decimal('5218.00')),
 (823, datetime.datetime(2014, 5, 5, 0, 0), '543200', 44, Decimal('1873.50')),
 (824, datetime.datetime(2014, 5, 5, 0, 0), '543201', 46, Decimal('510.00')),
 (822, datetime.datetime(2014, 5, 4, 0, 0), '543199', 80, Decimal('360.00')),
 (820, datetime.datetime(2014, 5, 4, 0, 0), '543197', 17, Decimal('86.85'))]